# St7GetAppendSRA

Returns the append/overwrite option for Spectral Response analysis.

Solver – Spectral Response

long St7GetAppendSRA(long uID, bool* Append)

Input Parameters

uID

Strand7 model file ID.

Output Parameters

Append

True if results are to be appended onto an existing .SRA result file; False if an existing result file is to be
overwritten.

Strand7 API Manual

Solver – Linear Transient Dynamic